{"paper_id": "0175", "header": {"generated_with": "S2ORC 1.0.0", "date_generated": "2024-03-20T17:52:55.556037Z"}, "title": "Explainable Intrusion Detection System in IoT Scenarios: A Cross-Device Model Training and Evaluation for Traffic Classification", "authors": [{"first": "Pietro", "middle": [], "last": "Ducange", "suffix": "", "affiliation": {"laboratory": "", "institution": "University of Pisa", "location": {}}, "email": "pietro.ducange@unipi.it"}, {"first": "Michela", "middle": [], "last": "Fazzolari", "suffix": "", "affiliation": {"laboratory": "", "institution": "University of Pisa", "location": {}}, "email": "michela.fazzolari@iit.cnr.it"}, {"first": "Francesco", "middle": [], "last": "Marcelloni", "suffix": "", "affiliation": {"laboratory": "", "institution": "Telematics National Research Council", "location": {}}, "email": "francesco.marcelloni@unipi.it"}], "year": "", "venue": null, "identifiers": {}, "abstract": "The proliferation of Internet of Things (IoT) devices in our daily lives has raised concerns about the security of transmitted data. Due to their limited resources, IoT devices are vulnerable to malware attacks and cyber threats. Detecting and classifying these attacks is crucial to mitigate their impact. Various intrusion detection techniques have been proposed for IoT, including approaches based on Machine Learning (ML) and Artificial Intelligence (AI). Most of the ML/AI-based intrusion detection techniques, though effective, often lack transparency and trustworthiness. To address these aspects, eXplainable Artificial Intelligence (XAI) has emerged as a promising solution, providing insights on AI model decisions. In this work, we describe an explainable Intrusion Detection System (IDS) in IoT networks which embeds a multi-way Fuzzy Decision Tree (FDT) as an XAI model for traffic classification. We propose a Cross-Device training and evaluation approach in which we evaluate the generalization capability of the IDS when new devices are connected to the IoT network without retraining the FDT.", "pdf_parse": {"abstract": [{"text": "The proliferation of Internet of Things (IoT) devices in our daily lives has raised concerns about the security of transmitted data. Due to their limited resources, IoT devices are vulnerable to malware attacks and cyber threats. Detecting and classifying these attacks is crucial to mitigate their impact. Various intrusion detection techniques have been proposed for IoT, including approaches based on Machine Learning (ML) and Artificial Intelligence (AI). Most of the ML/AI-based intrusion detection techniques, though effective, often lack transparency and trustworthiness. To address these aspects, eXplainable Artificial Intelligence (XAI) has emerged as a promising solution, providing insights on AI model decisions. In this work, we describe an explainable Intrusion Detection System (IDS) in IoT networks which embeds a multi-way Fuzzy Decision Tree (FDT) as an XAI model for traffic classification. We propose a Cross-Device training and evaluation approach in which we evaluate the generalization capability of the IDS when new devices are connected to the IoT network without retraining the FDT.", "cite_spans": [], "section": "Abstract", "sec_num": null}], "body_text": [{"text": "The widespread adoption of IoT devices in our daily lives has raised concerns about the security of the data they transmit over networks. Due to their limited resources, IoT devices are more susceptible to malware attacks and other forms of cyber threats (Abdul-Ghani et al., 2018) . Such attacks can have severe consequences, including data theft, physical damage, network disruption, and device malfunction. Therefore, it is crucial to detect and classify these attacks to mitigate their impact.", "cite_spans": [{"start": 255, "end": 281, "text": "(Abdul-Ghani et al., 2018)", "ref_id": "BIBREF0"}], "section": "Introduction", "sec_num": "1."}, {"text": "In the field of IoT, various intrusion detection techniques have been proposed These techniques include signature-based detection (Soe et al., 2019) , behavior-based detection (Devesa et al., 2010) , ML-based detection (Gaurav et al., 2022) , and sandboxing approaches (Le and Ngo, 2020) . In the last decades, ML-based intrusion detection techniques have gained prominence in the field of cybersecurity due to their effectiveness and flexibility in detecting cyber attacks (Asharf et al., 2020) . However, many of these techniques rely on black-box ML models, such as deep learning networks and random forests, thus lacking transparency and trustworthiness, which are essential requirements in cybersecurity.", "cite_spans": [{"start": 130, "end": 148, "text": "(Soe et al., 2019)", "ref_id": "BIBREF30"}, {"start": 176, "end": 197, "text": "(Devesa et al., 2010)", "ref_id": "BIBREF13"}, {"start": 219, "end": 240, "text": "(Gaurav et al., 2022)", "ref_id": "BIBREF17"}, {"start": 269, "end": 287, "text": "(Le and Ngo, 2020)", "ref_id": "BIBREF22"}, {"start": 474, "end": 495, "text": "(Asharf et al., 2020)", "ref_id": "BIBREF4"}], "section": "Introduction", "sec_num": "1."}, {"text": "To address these limitations, eXplainable Artificial Intelligence (XAI) has emerged as a promising solution for detecting cyber attacks in IoT networks (Patil et al., 2022; Wang et al., 2020) . XAI provides insights into how and why AI models make decisions, enhancing the transparency and trustworthiness of Intrusion Detection Systems (IDSs) (Arrieta et al., 2020) . XAI models can be categorized into two families: explainable-by-design models and models explained using post-hoc methods. The models belonging to the first family include Decision Trees (DTs) and rule-based systems, and have an intrinsic interpretability of their structure. As regards the second family, post-hoc methods, such as Local Interpretable Model-Agnostic Explanations (LIME) and SHapley Additive exPlanations (SHAP) Values, introduced in Ribeiro et al., 2016 and Lundberg and Lee, 2017 respectively, can be used to explain black-box models such as ensemble models and Deep Neural Network (DNN) .", "cite_spans": [{"start": 152, "end": 172, "text": "(Patil et al., 2022;", "ref_id": "BIBREF26"}, {"start": 173, "end": 191, "text": "Wang et al., 2020)", "ref_id": "BIBREF33"}, {"start": 344, "end": 366, "text": "(Arrieta et al., 2020)", "ref_id": "BIBREF3"}, {"start": 819, "end": 843, "text": "Ribeiro et al., 2016 and", "ref_id": "BIBREF28"}, {"start": 844, "end": 856, "text": "Lundberg and", "ref_id": "BIBREF23"}, {"start": 857, "end": 866, "text": "Lee, 2017", "ref_id": "BIBREF23"}, {"start": 969, "end": 974, "text": "(DNN)", "ref_id": null}], "section": "Introduction", "sec_num": "1."}, {"text": "In this work, we propose a novel experimental training and evaluation setup of an explainable IDS for IoT networks, that we have recently introduced in Fazzolari et al., 2023 . Specifically, we consider an IoT network in which an IDS has been deployed on an edge node, such as an edge computing gateway (see Beniwal and Singhrova, 2022 for details on this type of gateway). The IDS was implemented by adopting a Fuzzy Decision Tree (FDT) as XAI model. In particular, we employed the model introduced in Segatori et al., 2017. This Multi-way FDT has been successfully applied in various domains, including next-generation networks (Renda et al., 2021) and smart vehicles (Aversano et al., 2022) .", "cite_spans": [{"start": 152, "end": 174, "text": "Fazzolari et al., 2023", "ref_id": "BIBREF15"}, {"start": 308, "end": 335, "text": "Beniwal and Singhrova, 2022", "ref_id": "BIBREF7"}, {"start": 503, "end": 525, "text": "Segatori et al., 2017.", "ref_id": "BIBREF29"}, {"start": 630, "end": 650, "text": "(Renda et al., 2021)", "ref_id": "BIBREF27"}, {"start": 670, "end": 693, "text": "(Aversano et al., 2022)", "ref_id": "BIBREF5"}], "section": "Introduction", "sec_num": "1."}, {"text": "In our experimental analysis, first, we train the FDT embedded in the IDS, with a set of labeled historical data regarding benign and malicious network traffic data generated by the devices connected to the network. Then, we evaluate the generalization capability of the IDS whenever a new device is connected to the IoT network, without retraining the FDT. We labeled this methodology as cross-device model training and evaluation approach. We evaluated the effectiveness of this approach using a real dataset, namely the well-known n-BaIoT dataset Meidan et al., 2018: it consists of network traffic data from 9 IoT devices. We considered two experimental scenarios: in each scenario, we trained the FDT, used to distinguish network traffic into malicious or benign in real-time, with labeled data from 8 devices and tested it with traffic data from the remaining device. We chose to consider only 2 devices for the testing phase because only the 2 selected devices in the dataset turn out to be completely different from the remaining 7 devices. We compare the results achieved following the proposed cross-device training and evaluation approach with the ones achieved by building a specific XAI model for each device considered in the 2 experimental scenarios. In the comparison, we achieve similar results in terms of classification performance, while the complexity of the generated FDTs with the cross-device approach is always the highest.", "cite_spans": [{"start": 550, "end": 570, "text": "Meidan et al., 2018:", "ref_id": "BIBREF25"}], "section": "Introduction", "sec_num": "1."}, {"text": "The rest of the paper is organized as follows: in Section 2 we analyze the most recent state-of-the-art literature on AI and XAI models for IDS in IoT networks. In Section 3 we describe the proposed cross-device training and evaluation methodology and provide some details on the datasets and on FDTs adopted in our experiments. Section 4 illustrates the experimental setup and discusses the achieved results. Finally, in Section 5 we draw some conclusions.", "cite_spans": [], "section": "Introduction", "sec_num": "1."}, {"text": "In recent years, the proliferation of IoT devices has increased the need for robust security mechanisms, including intrusion detection. IDSs are designed to detect and respond to unauthorized activities or potential threats in a network. With the unique characteristics and challenges posed by IoT networks, IDS solutions tailored for IoT environments have gained significant attention (Benkhelifa et al., 2018) . In the following, we provide a synthesis of the recent state of the art regarding IDS in IoT Networks, including also some recent works which describe XAI models for cybersecurity in IoT Networks.", "cite_spans": [{"start": 386, "end": 411, "text": "(Benkhelifa et al., 2018)", "ref_id": "BIBREF8"}], "section": "Related Work", "sec_num": "2."}, {"text": "Traditional IDS techniques, such as signature-based detection and anomaly detection, have been applied to IoT networks. However, they face challenges and limitations, due to the resource constraints, network heterogeneity, scalability, and susceptibility to zero-day attacks inherent in IoT environments. To address these challenges, research has shifted towards more advanced approaches, such as ML-based IDSs, which leverage AI techniques to handle the complexities of IoT networks and improve detection accuracy (see Verma and Ranga, 2020 for a recent survey on this topic).", "cite_spans": [{"start": 520, "end": 541, "text": "Verma and Ranga, 2020", "ref_id": "BIBREF32"}], "section": "Related Work", "sec_num": "2."}, {"text": "The specialized literature features several highly cited works in the field of AI models for cybersecurity in IoT networks.", "cite_spans": [], "section": "Related Work", "sec_num": "2."}, {"text": "Notably, Meidan et al., 2018 and Aminanto et al., 2018 While the aforementioned works prioritize accuracy over explainability, recent research has shown a growing interest in XAI for cybersecurity in IoT scenarios. Several papers and surveys (see Capuano et al., 2022; Zhang et al., 2022) provide comprehensive overviews of XAI approaches in the field. Specifically, the recent survey of Zhang et al., 2022 Notably, all the aforementioned approaches employ post-hoc methods to achieve explainability. In contrast, the present paper exploits an explainable IDS for IoT networks based on FDT. These models are well known for their inherent global and local explainability due to their linguistic representation and the possibility of extracting semantic rules for decision-making.", "cite_spans": [{"start": 9, "end": 32, "text": "Meidan et al., 2018 and", "ref_id": "BIBREF25"}, {"start": 33, "end": 54, "text": "Aminanto et al., 2018", "ref_id": "BIBREF2"}, {"start": 247, "end": 268, "text": "Capuano et al., 2022;", "ref_id": "BIBREF10"}, {"start": 269, "end": 288, "text": "Zhang et al., 2022)", "ref_id": "BIBREF35"}, {"start": 388, "end": 406, "text": "Zhang et al., 2022", "ref_id": "BIBREF35"}], "section": "Related Work", "sec_num": "2."}, {"text": "This section provides a detailed description of the proposed cross-device approach. We envision a smart home IoT network consisting of a set of devices such as security cameras, webcams, baby monitors, and doorbells. We assume that the network is equipped with an edge computing node, such as an IoT Smart Gateway, which acts both as a modem/router for connecting the devices on the Internet, and as a computing unit close to the devices. Thanks to the IoT Smart Gateway, we can deploy our IDS on the IoT network itself, without the need of offloading the data elaboration on the cloud.", "cite_spans": [], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "The task of IDS is to analyze the generated network traffic of IoT devices and distinguish malicious traffic from genuine traffic. In fact, devices could be infected, for example by botnets (see Ali et al., 2020 for more details on botnets in IoT networks), and could generate malicious traffic in addition to normal network traffic", "cite_spans": [{"start": 195, "end": 211, "text": "Ali et al., 2020", "ref_id": "BIBREF1"}], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "In Figure 1 , we show the scheme of the envisioned IoT home scenario, equipped with our explainable IDS.", "cite_spans": [], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "The overall IDS is composed of three main modules:", "cite_spans": [], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "• Data collector: it is in charge of collecting • Feature extractor: it extracts numerical features from the network flow. This flow is composed of network packets: when a packet flows in the network, we take a snapshot of the hosts, both senders and receivers, and of the protocols used for transmitting the packets themselves by extracting a set of statistics. In our IDS, we consider the feature extraction strategy discussed in Meidan et al., 2018 .", "cite_spans": [{"start": 432, "end": 451, "text": "Meidan et al., 2018", "ref_id": "BIBREF25"}], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "• Real-time traffic classifier: it discriminates genuine from malicious traffic. The latter is also classified into several predefined attack types. As mentioned above, with the aim of also providing explanations to the classification task, an XAI model by design, i.e., a multi-way FDT, was designed and experimented to be embedded in this module. To improve the transparency of the overall IDS, this module can be equipped with a logging service that can detect the decision tree paths that have been activated and adopted to classify each traffic trace.", "cite_spans": [], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "It is worth noting that the FDT must be trained using a set of labeled data, namely a set of historical network flows representing both genuine and malicious traffic. To this aim, we suppose to have such labeled historical data generated by the set of devices connected to the network. In the literature, we have found that two approaches are usually adopted: a local classification model is built for each specific device (Cunha et al., 2022; Tran and Dang, 2022) or a global centralized classification model, used for the classification of the traffic generated by all the devices in the network, is built using the historical data collected from all the devices connected to the network (Faysal et al., 2022) . In both cases, if a new device is connected to the network, a new model training procedure or a model updating task is usually required.", "cite_spans": [{"start": 423, "end": 443, "text": "(Cunha et al., 2022;", "ref_id": "BIBREF12"}, {"start": 444, "end": 464, "text": "Tran and Dang, 2022)", "ref_id": "BIBREF31"}, {"start": 690, "end": 711, "text": "(Faysal et al., 2022)", "ref_id": "BIBREF14"}], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "In this work, we carried out an experimental analysis in which we: i) train the classification model with the historical and labelled data collected from the existing devices in the network and ii) test the generalization capability of our IDS, namely its capability of detecting malicious traffic generated by a new device, without re-training or updating the classification model. We labeled this approach as cross-device training and evaluation.", "cite_spans": [], "section": "Cross-Device Model Training and Evaluation for IDS in IoT Networks", "sec_num": "3."}, {"text": "In order to test the cross-device training and evaluation approach of our explainable IDS, we resort to a well-known dataset, namely n-BaIoT dataset (Meidan et al., 2018) . It is publicly available from UCI's machine learning repository 1 . It includes real traffic data, gathered from 9 IoT devices, which include both benign and malicious traffic. In particular, the malicious traffic encompasses 10 different cyber attacks, generated by two botnets, namely BASHLITE and Mirai.", "cite_spans": [{"start": 149, "end": 170, "text": "(Meidan et al., 2018)", "ref_id": "BIBREF25"}], "section": "Datasets", "sec_num": "3.1."}, {"text": "The nine IoT devices available in the dataset are: Danmini Doorbell, Ecobee Thermostat, Ennio Doorbell, Philips B120N10 Baby Monitor, Provision PT 737E Security Camera, Provision PT 838 Security Camera, Samsung SNH 1011 N Webcam, SimpleHome XCS7 1002 WHT Security Camera, and SimpleHome XCS7 1003 WHT Security Camera. The majority of these devices were infected by both BASHLITE and Mirai. However, Ennio Doorbell and Samsung SNH 1011 N Webcam were solely infected by BASHLITE. For this reason, for each device, we extracted the data belonging to the BASHLITE botnet. Therefore, the final number of classes considered is equal to 6, one representing benign traffic and 5 representing different types of cyber attacks, generated by a BASHLITE botnet. The five types of attacks in the dataset are:", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "• Junk: it consists in sending spam data;", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "• Scan: it consists in scanning the network for vulnerable devices;", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "• Combo: it identifies two attacks carried out at the same time, i.e. sending spam data and opening a connection to a specified IP address and port;", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "1 urly.it/3vx20", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "• TCP: it consists in TCP flooding;", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "• UDP: it consists in UDP flooding.", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "Table 1 describes the class distribution for each device.", "cite_spans": [], "section": "Datasets", "sec_num": "3.1."}, {"text": "In the original dataset, the network traffic generated by each device is represented by using 115 features, which are traffic statistics over several temporal windows, as discussed in Meidan et al., 2018. Specifically, these statistics include counting, mean and variance of values such as packet size and packet jitter, extracted at different time windows. Experts in IoT networks, who are the main users of our IDS, are familiar with these statistics and we expect that they may easily interpret the explanations provided in terms of linguistic rules by our MFDT. However, different types of features may be extracted from the real-time network traffic flow generated by the different devices connected to the IoT network.", "cite_spans": [{"start": 184, "end": 204, "text": "Meidan et al., 2018.", "ref_id": "BIBREF25"}], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "However, in order to reduce the computation effort required both to extract features from network traffic and to train the classification model, in our experiments we carried out a preliminary feature selection process. Specifically, we used a filter method based on the minimum-redundancy-maximum-relevance feature evaluation strategy.", "cite_spans": [], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "It is worth to recall that filter methods for feature selection, unlike wrapper methods that adopt a specific classification algorithm for evaluating the goodness of a feature subset, are general methods independent from the classification model that will be then trained using the selected features. Moreover, filter methods are more computationally efficient than the wrapper ones. In our experiment, we adopted the Correlation-based Feature Selection Subset (CFS) Evaluator (Hall, 1999) which evaluates the worth of a subset of features by considering the individual predictive ability of each feature along with the degree of redundancy between them. Subsets of features that are highly correlated with the class while having low correlation between them are preferred.", "cite_spans": [{"start": 477, "end": 489, "text": "(Hall, 1999)", "ref_id": "BIBREF18"}], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "To identify the optimal subset of features, both wrapper and filter methods should test exhaustively all the possible combinations of the features. Since the number of these combinations increases factorially with the number of features, this approach becomes unfeasible in high dimensional problems.", "cite_spans": [], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "Thus, heuristic approaches are generally adopted and in our experiments we adopted the Best First algorithm. This algorithm starts with an empty set of features and generates all possible single feature expansions. The expansion with the best rank, calculated using CFS evaluator, is chosen and expanded in the same manner by adding single features. If expanding a subset results in no improvement, the search drops back to the next best unexpanded subset and continues from there. We used a stopping criterion of five consecutive fully expanded non-improving subsets.", "cite_spans": [], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "We adopted the Python wrapper of the WEKA (Frank et al., 2005) implementation of the Best First algorithm with the CFS evaluator 2 .", "cite_spans": [{"start": 42, "end": 62, "text": "(Frank et al., 2005)", "ref_id": "BIBREF16"}], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "We ran the feature selection on the training sets of two cross-device scenarios composed by 8 out 9 devices included in the n-BaIoT dataset. The following 6 relevant features were identified:", "cite_spans": [], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "1 A feature sensitivity analysis for ML-based botnet detection in IoT networks, including the N-BaIoT dataset, has been discussed in Kalakoti et al., 2022. We carried out some experimental comparisons and, using the 6 features selected with our approach, we achieved similar or better results than the ones achieved considering different combinations of the input features identified in Kalakoti et al., 2022. ", "cite_spans": [{"start": 133, "end": 155, "text": "Kalakoti et al., 2022.", "ref_id": "BIBREF21"}, {"start": 387, "end": 409, "text": "Kalakoti et al., 2022.", "ref_id": "BIBREF21"}], "section": "Feature Selection", "sec_num": "3.2."}, {"text": "In this work, we adopted the multi-way FDT, introduced in Segatori et al., 2017, as XAI model to be embedded in our IDS as Network Traffic Classifier. The FDT is a variant of the traditional decision tree that incorporates fuzzy logic principles. In a multi-way FDT, each decision node evaluates linguistic conditions instead of crisp thresholds.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "Let X = {X 1 , X 2 , . . . , X F } be the set of input attributes of a dataset used for classification.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "2 https://fracpete.github.io/python-weka-wrapper3/api.html Each instance x k = {x k,1 , x k,2 , . . . , x k,F } has an associated label y k which takes values in the set C = {C 1 , C 2 , . . . , C M }, with M denoting the number of possible classes. Consider a generic input attribute X f defined on the universe U f as a bounded interval in R. Let Z f = {A f,1 , A f,2 , . . . , A f,T f } be a partition over U f consisting of T f fuzzy sets. In this paper, we adopt strong triangular fuzzy partitions: each fuzzy set A f,i is fully described through a tuple (a f,i , b f,i , c f,i ), where a f,i and c f,i correspond to the left and right extremes of the support of A f,i , and b f,i to its core. Figures 2 and 3 show, respectively, an example of strong triangular fuzzy partition and an example of multi way-FDT. It is worth to notice that unlike binary DTs, which split the data at each node into two branches based on a specific attribute, a multi-way FDT can have multiple branches at each node.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "A f,1 A f,3 A f,2 b f,1 =a f,2 c f,2 =b f,2 =a f,3 c f,2 =b f,3", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "A 2,2 A 2,1 A 2,3 A 1,1 A 1,3 A 1,2 C 2 C 1 C 1 C 1 C 3 X 1 X 2 Figure 3", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": ". An example of multi-way FDT.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "In our FDT, the number of branches originating from each decision node is equal to the number of fuzzy sets used for partitioning the input feature X f selected in the node. In our experiments, we employed the fuzzy discretization algorithm described in Segatori et al., 2017, which is based on fuzzy information entropy, to generate a strong fuzzy partition for each input feature. To ensure control over the complexity and explainability level of the FDT, we set the maximum number of fuzzy sets in each fuzzy partition to T max . While classical Decision Tree (DT) typically use metrics such as Gini Index or Information Gain to select the most discriminative feature during the recursive tree-building process (see Breiman et al., 1984 for more details), our FDT employs the Fuzzy Information Gain metric for splitting. In our experiments, we stopped the tree-building procedure when the value of the fuzzy information gain fell below a predefined threshold of 10 -6 , as recommended in Segatori et al., 2017. Once the FDT has been generated, we can extract a rule base, namely a set of linguistic if-then fuzzy rules, following each path from the root of the tree to a leaf. Each rule has a weight which is equal to the fuzzy cardinality of the leaf associated with the rule itself. The fuzzy cardinality, introduced in Segatori et al., 2017, is calculated as the sum of the matching degrees of each training instance in each node from the root to the specific leaf. In practice, the weight is a sort of fuzzy support of the rule. It is worth clarifying that since the FDT is built recursively, choosing at each recursive step the most relevant feature (a feature can be chosen only once), it is impossible to generate contradictory and overlapped rules.", "cite_spans": [{"start": 254, "end": 276, "text": "Segatori et al., 2017,", "ref_id": "BIBREF29"}, {"start": 719, "end": 739, "text": "Breiman et al., 1984", "ref_id": "BIBREF9"}, {"start": 991, "end": 1013, "text": "Segatori et al., 2017.", "ref_id": "BIBREF29"}], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "The rule base can be used to classify any unlabeled instance x.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "Since an unlabeled instance x may simultaneously activate multiple rules, the inference process computes the matching degree of each rule, i.e. the strength of activation. In this paper, the instance is assigned to the class that corresponds to the maximum association degree, i.e. the product of the matching degrees of a specific rule and the weight associated with each class label in the rule. Using this inference strategy, a single rule can explain how classification output has been obtained, thus ensuring a high local explainability level.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "As regards the global explainability of FDTs, it is apparent that large trees with numerous branches and nodes pose challenges in terms of comprehension and interpretation. Concerning local explainability, a higher value of T max corresponds to an increased number of potential testing conditions within the tree and potentially deeper trees in terms of levels. These two factors impact the explainability of individual rules, particularly influencing the number of linguistic terms used in each antecedent condition and the total number of conditions in the antecedent. However, it is worth noting that when dealing with rules extracted from Fuzzy Decision Trees (FDTs), the maximum number of conditions in the antecedent of each rule is equal to the number of features selected by the feature selection process, or less, if the algorithm for building the tree stops before analyzing all the features.", "cite_spans": [], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "More details on the adopted FDT can be found in Segatori et al., 2017. ", "cite_spans": [{"start": 48, "end": 70, "text": "Segatori et al., 2017.", "ref_id": "BIBREF29"}], "section": "The Adopted XAI model as Network Traffic Classifier", "sec_num": "3.3."}, {"text": "As stated before, in our experimental analysis, we consider two cross-device scenarios in which we: i) build the IDS system, embedding in it a multi-way FDT trained with the labeled network data extracted from 8 out of the 9 devices included in the n-BaIoT dataset and ii) evaluate the generalization capability of the system by using the network data extracted from the remaining device. Specifically, each scenario is characterized by a specific testing device, namely Ecobee Thermostat and Philips B120N10 Baby Monitor, respectively. This approach simulates the addition of a new device to an existing IoT network and the direct usage of the IDS without retraining or updating the real-time network traffic classification module.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "For the sake of comparison, we also show the results achieved, for each of the two selected devices, considering a five-fold cross-validation, building a specific classification model for each device. It is worth noting that this comparison is actually fair because, for each of the two selected devices, the total number of evaluated instances in cross-validation is the same as in the cross-device approach. Through this comparison, we are able to assess how much a model trained with the cross-device approach loses, in terms of classification performance, compared to a scenario in which a specific traffic classification model is trained for each device.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "Both for the cross-device scenarios and for the single-device cross-validation experiments, we carried out the analysis of the different trade-offs between the model complexity and its capability to correctly distinguish benign network traffic from 5 different types of malicious traffic. To this aim, for each experimental analysis, 3 different FDTs have been generated setting T max equal to 3, 5 and 7. It is worth recalling that the complexity of the model, expressed in terms of the number of leaves (#Leaves) and the total number of nodes (#Nodes) of the tree, is closely related to the interpretability of the model. Indeed, the greater the complexity of the FDT, the more difficult it will be to analyze its structure and understand the conditions that lead to a decision. In the table, we also show the Depth of the FDTs, which represent the maximum number of conditions that can be present in the antecedent of a rule extracted from an FDT.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "Table 2 shows the results achieved for each experiment, namely for each device (Ecobee Thermostat and Philips B120N10 Baby Monitor) analyzed in cross-device and in cross-validation, respectively. Regarding the classification capability of each generated FDT, we show the average values of Precision, Recall and F1-measure metrics, weighted on the number of instances in each class. It is worth noting that for the cross-validation experiments, the table shows the average results achieved on the five folds.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "As expected, results highlight that the classification performance of the FDTs increases as the number of fuzzy sets increases, but at the same time, the complexity also increases.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "On the other hand, if we compare the results obtained by applying the cross-device approach with the ones obtained in cross-validation, we see that the classification capability remains more or less at the same level. However, it is worth observing that in some experimental setups, the models trained using the cross-device approach lose around 5%-7% in terms of F1-measure with respect to the models trained in cross-validation. There exists also a couple of situations in which the achieved F1-measures are slightly higher than the ones achieved in cross-validation.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "As regards the complexity of the model, it is slightly higher for the cross-device approach than the cross-validation approach, but it remains of the same order of magnitude. This is possibly due to the fact that in cross-device the number of the training instances is much higher than in cross-validation.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "We also analyzed the results shown in a couple of recent works in which the N-BaIoT dataset has been used (Cunha et al., 2022; Tran and Dang, 2022) . Authors adopted a cross-validation evaluation strategy building a model for each device. We realized that the results obtained using the FDTs are mostly in line, especially when considering the most complex ones, with those obtained from black-box models, namely Neural Network (NN), DNN and Random Forests.", "cite_spans": [{"start": 106, "end": 126, "text": "(Cunha et al., 2022;", "ref_id": "BIBREF12"}, {"start": 127, "end": 147, "text": "Tran and Dang, 2022)", "ref_id": "BIBREF31"}], "section": "Results and discussion", "sec_num": "4."}, {"text": "To better understand the behaviour of each FDT experimented in the cross-device scenario, we report in Figures 4 and 5 the value of the F1-measure for each class, considering Ecobee Thermostat and Philips B120N10 Baby Monitor devices, respectively.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "We observe that for both devices the F1-measure of the benign class is always equal to one. This indicates that this class is recognized perfectly, and no attack is misclassified as benign traffic. The F1-measure exhibits a similar pattern for the other classes across the 2 devices. For example, the F1-measure value for the junk class is lower than the F1-measure values of the other classes. This is particularly evident when the models with a value of T max equal to 3 are considered. In this case, we observed that the junk class is frequently mistaken for the combo class. A similar situation also arises with the tcp and udp classes, as they are often confused with each other, leading to lower F1-measure values. From a broad perspective, it is evident that as the complexity of the model increases, there is an improvement in the model's ability to accurately detect classes. However, this comes at the cost of reduced explainability of the FDT.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "In Table 3 , we show a subset of explainable linguistic rules extracted from the FDT that we used for testing the traffic generated by Ecobee Thermostat and trained using the remaining devices in the dataset. Specifically, we show, for each class, the rule associated with the highest weight. In this FDT the most discriminant feature is represented by the number of packets from the sending device in the past 1.5s. Anomalies in this feature, either low or high values, are indicative of malicious traffic. On the contrary, if the value falls within a medium range, the traffic is classified as benign. However, for traffic to be actually classified as benign, it is also necessary to consider that the average number of traffic jitters between the sending and destination devices in the past 10 seconds must be high.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "In conclusion, it is important to consider that in the cross-device experimental analysis, the data used to train the model came from devices completely different from those used in the two test scenarios. Therefore, the results obtained give us confidence in the feasibility of the cross-device approach for implementing an IDS in an IoT network. Furthermore, they point out its potential for monitoring the traffic generated by newly added devices within the network. Finally, the adoption of FDT as an explainable by-design classifier will facilitate to design tools for explaining how our IDS works, such as logging services and interactive dashboards for network traffic classification with explanations.", "cite_spans": [], "section": "Results and discussion", "sec_num": "4."}, {"text": "In this paper, we discussed an Internet of Things scenario in which a set of smart devices are connected to a home network and generate packet traffic flows. With the goal of protecting the network from malicious traffic, which can be generated if some devices are infected by a botnet, we designed, developed and tested an explainable Intrusion Detection System to be implemented on an edge node of the network. The explainability of the system was ensured by incorporating a multi-way fuzzy decision tree (FDT) for real-time traffic classification.", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}, {"text": "We proposed a novel cross-device approach for FDT training and evaluation to be used to distinguish network traffic between authentic and malicious. Using this approach, FDT was constructed using historical and labeled traffic data extracted from devices connected to an IoT network. The generalization capability of the trained FDT was then evaluated using data generated by a new device added to the IoT network.", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}, {"text": "The results showed that with the proposed cross-device approach, the traffic flow generated by new devices added to an IoT network, on which our explainable IDS was deployed, can be classified correctly, without the need to retrain or update the traffic classification model. Future research will address the following challenges:", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}, {"text": "• Conducting Additional Experimental Analyses:", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}, {"text": "This includes a sensitivity analysis on the extracted and selected features and the use of other datasets related to intrusion detection in IoT networks.", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}, {"text": "• Exploring Cross-Device Procedures with Black-box models: The objective is to experiment with Intrusion Detection Systems generated by using black-box models. These models will be explained through post-hoc explainability methods. The results of this experimentation will be compared with the ones obtained by", "cite_spans": [], "section": "Conclusions", "sec_num": "5."}], "bib_entries": {"BIBREF0": {"ref_id": "b0", "title": "A comprehensive iot attacks survey based on a building-blocked reference model", "authors": [{"first": "H", "middle": ["A"], "last": "Abdul-Ghani", "suffix": ""}, {"first": "D", "middle": [], "last": "Konstantas", "suffix": ""}, {"first": "M", "middle": [], "last": "Mahyoub", "suffix": ""}], "dblp_id": null, "year": 2018, "venue": "International Journal of Advanced Computer Science and Applications", "volume": "9", "issue": "3", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Abdul-Ghani, H. A., Konstantas, D., & Mahyoub, M. (2018). A comprehensive iot attacks survey based on a building-blocked reference model. International Journal of Advanced Computer Science and Applications, 9(3).", "links": null}, "BIBREF1": {"ref_id": "b1", "title": "Systematic literature review on iot-based botnet attack", "authors": [{"first": "I", "middle": [], "last": "Ali", "suffix": ""}, {"first": "A", "middle": ["I A"], "last": "Ahmed", "suffix": ""}, {"first": "A", "middle": [], "last": "Almogren", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Raza", "suffix": ""}, {"first": "S", "middle": ["A"], "last": "Shah", "suffix": ""}, {"first": "A", "middle": [], "last": "Khan", "suffix": ""}, {"first": "A", "middle": [], "last": "Gani", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "IEEE Access", "volume": "8", "issue": "", "pages": "212220--212232", "other_ids": {}, "num": null, "urls": [], "raw_text": "Ali, I., Ahmed, A. I. A., Almogren, A., Raza, M. A., Shah, S. A., Khan, A., & Gani, A. (2020). Systematic literature review on iot-based botnet attack. IEEE Access, 8, 212220-212232.", "links": null}, "BIBREF2": {"ref_id": "b2", "title": "Deep abstraction and weighted feature selection for wi-fi impersonation detection", "authors": [{"first": "M", "middle": ["E"], "last": "Aminanto", "suffix": ""}, {"first": "R", "middle": [], "last": "Choi", "suffix": ""}, {"first": "H", "middle": ["C"], "last": "Tanuwidjaja", "suffix": ""}, {"first": "P", "middle": ["D"], "last": "Yoo", "suffix": ""}, {"first": "K", "middle": [], "last": "Kim", "suffix": ""}], "dblp_id": null, "year": 2018, "venue": "IEEE Transactions on Information Forensics and Security", "volume": "13", "issue": "3", "pages": "621--636", "other_ids": {}, "num": null, "urls": [], "raw_text": "Aminanto, M. E., Choi, R., Tanuwidjaja, H. C., Yoo, P. D., & Kim, K. (2018). Deep abstraction and weighted feature selection for wi-fi impersonation detection. IEEE Transactions on Information Forensics and Security, 13(3), 621-636.", "links": null}, "BIBREF3": {"ref_id": "b3", "title": "Explainable Artificial Intelligence (XAI): Concepts, taxonomies, opportunities and challenges toward responsible AI", "authors": [{"first": "A", "middle": ["B"], "last": "Arrieta", "suffix": ""}, {"first": "N", "middle": [], "last": "Díaz-Rodríguez", "suffix": ""}, {"first": "J", "middle": [], "last": "Del Ser", "suffix": ""}, {"first": "A", "middle": [], "last": "Bennetot", "suffix": ""}, {"first": "S", "middle": [], "last": "Tabik", "suffix": ""}, {"first": "A", "middle": [], "last": "Barbado", "suffix": ""}, {"first": "S", "middle": [], "last": "García", "suffix": ""}, {"first": "S", "middle": [], "last": "Gil-López", "suffix": ""}, {"first": "D", "middle": [], "last": "Molina", "suffix": ""}, {"first": "R", "middle": [], "last": "Benjamins", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "Inf. Fusion", "volume": "58", "issue": "", "pages": "82--115", "other_ids": {}, "num": null, "urls": [], "raw_text": "Arrieta, A. B., Díaz-Rodríguez, N., Del Ser, J., Bennetot, A., Tabik, S., Barbado, A., García, S., Gil-López, S., Molina, D., Benjamins, R., et al. (2020). Explainable Artificial Intelligence (XAI): Concepts, taxonomies, opportunities and challenges toward responsible AI. Inf. Fusion, 58, 82-115.", "links": null}, "BIBREF4": {"ref_id": "b4", "title": "A review of intrusion detection systems using machine and deep learning in internet of things: Challenges, solutions and future directions", "authors": [{"first": "J", "middle": [], "last": "Asharf", "suffix": ""}, {"first": "N", "middle": [], "last": "Moustafa", "suffix": ""}, {"first": "H", "middle": [], "last": "Khurshid", "suffix": ""}, {"first": "E", "middle": [], "last": "Debie", "suffix": ""}, {"first": "W", "middle": [], "last": "Haider", "suffix": ""}, {"first": "A", "middle": [], "last": "Wahab", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "Electronics", "volume": "9", "issue": "7", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Asharf, J., Moustafa, N., Khurshid, H., Debie, E., Haider, W., & Wahab, A. (2020). A review of intrusion detection systems using machine and deep learning in internet of things: Challenges, solutions and future directions. Electronics, 9(7), 1177.", "links": null}, "BIBREF5": {"ref_id": "b5", "title": "An explainable and evolving car driver identification system based on decision trees", "authors": [{"first": "L", "middle": [], "last": "Aversano", "suffix": ""}, {"first": "M", "middle": ["L"], "last": "Bernardi", "suffix": ""}, {"first": "M", "middle": [], "last": "Cimitile", "suffix": ""}, {"first": "P", "middle": [], "last": "Ducange", "suffix": ""}, {"first": "M", "middle": [], "last": "Fazzolari", "suffix": ""}, {"first": "R", "middle": [], "last": "Pecori", "suffix": ""}], "dblp_id": "conf/eais/AversanoBCDFP22", "year": 2022, "venue": "IEEE International Conference on Evolving and Adaptive Intelligent Systems (EAIS)", "volume": "", "issue": "", "pages": "1--8", "other_ids": {}, "num": null, "urls": [], "raw_text": "Aversano, L., Bernardi, M. L., Cimitile, M., Ducange, P., Fazzolari, M., & Pecori, R. (2022). An explainable and evolving car driver identification system based on decision trees. 2022 IEEE International Conference on Evolving and Adaptive Intelligent Systems (EAIS), 1-8.", "links": null}, "BIBREF6": {"ref_id": "b6", "title": "Intrusion detection in iot using deep learning", "authors": [{"first": "A", "middle": ["M"], "last": "Banaamah", "suffix": ""}, {"first": "I", "middle": [], "last": "Ahmad", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "Sensors", "volume": "22", "issue": "21", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Banaamah, A. M., & Ahmad, I. (2022). Intrusion detection in iot using deep learning. Sensors, 22(21).", "links": null}, "BIBREF7": {"ref_id": "b7", "title": "A systematic literature review on iot gateways", "authors": [{"first": "G", "middle": [], "last": "Beniwal", "suffix": ""}, {"first": "A", "middle": [], "last": "Singhrova", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "Journal of King Saud University-Computer and Information Sciences", "volume": "34", "issue": "10", "pages": "9541--9563", "other_ids": {}, "num": null, "urls": [], "raw_text": "Beniwal, G., & Singhrova, A. (2022). A systematic literature review on iot gateways. Journal of King Saud University-Computer and Information Sciences, 34(10), 9541-9563.", "links": null}, "BIBREF8": {"ref_id": "b8", "title": "A critical review of practices and challenges in intrusion detection systems for iot: Toward universal and resilient systems", "authors": [{"first": "E", "middle": [], "last": "Benkhelifa", "suffix": ""}, {"first": "T", "middle": [], "last": "Welsh", "suffix": ""}, {"first": "W", "middle": [], "last": "Hamouda", "suffix": ""}], "dblp_id": null, "year": 2018, "venue": "IEEE Communications Surveys & Tutorials", "volume": "20", "issue": "4", "pages": "3496--3509", "other_ids": {}, "num": null, "urls": [], "raw_text": "Benkhelifa, E., Welsh, T., & Hamouda, W. (2018). A critical review of practices and challenges in intrusion detection systems for iot: Toward universal and resilient systems. IEEE Communications Surveys & Tutorials, 20(4), 3496-3509.", "links": null}, "BIBREF9": {"ref_id": "b9", "title": "Classification and regression trees", "authors": [{"first": "L", "middle": [], "last": "Breiman", "suffix": ""}, {"first": "J", "middle": [], "last": "Friedman", "suffix": ""}, {"first": "C", "middle": ["J"], "last": "Stone", "suffix": ""}, {"first": "R", "middle": ["A"], "last": "Olshen", "suffix": ""}], "dblp_id": null, "year": 1984, "venue": "", "volume": "", "issue": "", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Breiman, L., Friedman, J., Stone, C. J., & Olshen, R. A. (1984). Classification and regression trees. CRC press.", "links": null}, "BIBREF10": {"ref_id": "b10", "title": "Explainable artificial intelligence in cybersecurity: A survey", "authors": [{"first": "N", "middle": [], "last": "Capuano", "suffix": ""}, {"first": "G", "middle": [], "last": "Fenza", "suffix": ""}, {"first": "V", "middle": [], "last": "Loia", "suffix": ""}, {"first": "C", "middle": [], "last": "Stanzione", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "IEEE Access", "volume": "10", "issue": "", "pages": "93575--93600", "other_ids": {}, "num": null, "urls": [], "raw_text": "Capuano, N., Fenza, G., Loia, V., & Stanzione, C. (2022). Explainable artificial intelligence in cybersecurity: A survey. IEEE Access, 10, 93575-93600.", "links": null}, "BIBREF11": {"ref_id": "b11", "title": "Network intrusion detection for iot security based on learning techniques", "authors": [{"first": "N", "middle": [], "last": "Chaabouni", "suffix": ""}, {"first": "M", "middle": [], "last": "Mosbah", "suffix": ""}, {"first": "A", "middle": [], "last": "Zemmari", "suffix": ""}, {"first": "C", "middle": [], "last": "Sauvignac", "suffix": ""}, {"first": "P", "middle": [], "last": "Faruki", "suffix": ""}], "dblp_id": null, "year": 2019, "venue": "IEEE Communications Surveys & Tutorials", "volume": "21", "issue": "3", "pages": "2671--2701", "other_ids": {}, "num": null, "urls": [], "raw_text": "Chaabouni, N., Mosbah, M., Zemmari, A., Sauvignac, C., & Faruki, P. (2019). Network intrusion detection for iot security based on learning techniques. IEEE Communications Surveys & Tutorials, 21(3), 2671-2701.", "links": null}, "BIBREF12": {"ref_id": "b12", "title": "Classification of botnet attacks in iot using a convolutional neural network", "authors": [{"first": "A", "middle": ["A"], "last": "Cunha", "suffix": ""}, {"first": "J", "middle": ["B"], "last": "Borges", "suffix": ""}, {"first": "A", "middle": ["A"], "last": "Loureiro", "suffix": ""}], "dblp_id": "conf/mswim/CunhaNL22", "year": 2022, "venue": "Proceedings of the 18th ACM International Symposium on QoS and Security for Wireless and Mobile Networks", "volume": "", "issue": "", "pages": "63--70", "other_ids": {}, "num": null, "urls": [], "raw_text": "Cunha, A. A., Borges, J. B., & Loureiro, A. A. (2022). Classification of botnet attacks in iot using a convolutional neural network. Proceedings of the 18th ACM International Symposium on QoS and Security for Wireless and Mobile Networks, 63-70.", "links": null}, "BIBREF13": {"ref_id": "b13", "title": "Automatic behaviour-based analysis and classification system for malware detection", "authors": [{"first": "J", "middle": [], "last": "Devesa", "suffix": ""}, {"first": "I", "middle": [], "last": "Santos", "suffix": ""}, {"first": "X", "middle": [], "last": "Cantero", "suffix": ""}, {"first": "Y", "middle": ["K"], "last": "Penya", "suffix": ""}, {"first": "P", "middle": ["G"], "last": "Bringas", "suffix": ""}], "dblp_id": "conf/iceis/DevesaSCPB10", "year": 2010, "venue": "ICEIS", "volume": "2", "issue": "", "pages": "395--399", "other_ids": {}, "num": null, "urls": [], "raw_text": "Devesa, J., Santos, I., Cantero, X., Penya, Y. K., & Bringas, P. G. (2010). Automatic behaviour-based analysis and classification system for malware detection. ICEIS (2), 2, 395-399.", "links": null}, "BIBREF14": {"ref_id": "b14", "title": "Xgb-rf: A hybrid machine learning approach for iot intrusion detection", "authors": [{"first": "J", "middle": ["A"], "last": "Faysal", "suffix": ""}, {"first": "S", "middle": ["T"], "last": "Mostafa", "suffix": ""}, {"first": "J", "middle": ["S"], "last": "Tamanna", "suffix": ""}, {"first": "K", "middle": ["M"], "last": "Mumenin", "suffix": ""}, {"first": "M", "middle": ["M"], "last": "Arifin", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Awal", "suffix": ""}, {"first": "A", "middle": [], "last": "Shome", "suffix": ""}, {"first": "S", "middle": ["S"], "last": "Mostafa", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "Telecom", "volume": "3", "issue": "1", "pages": "52--69", "other_ids": {}, "num": null, "urls": [], "raw_text": "Faysal, J. A., Mostafa, S. T., Tamanna, J. S., Mumenin, K. M., Arifin, M. M., Awal, M. A., Shome, A., & Mostafa, S. S. (2022). Xgb-rf: A hybrid machine learning approach for iot intrusion detection. Telecom, 3(1), 52-69.", "links": null}, "BIBREF15": {"ref_id": "b15", "title": "An explainable intrusion detection system for iot networks", "authors": [{"first": "M", "middle": [], "last": "Fazzolari", "suffix": ""}, {"first": "P", "middle": [], "last": "Ducange", "suffix": ""}, {"first": "F", "middle": [], "last": "Marcelloni", "suffix": ""}], "dblp_id": null, "year": 2023, "venue": "IEEE International Confernce on Fuzzy Systems (FUZZ-IEEE)", "volume": "", "issue": "", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Fazzolari, M., Ducange, P., & Marcelloni, F. (2023). An explainable intrusion detection system for iot networks. 2023 IEEE International Confernce on Fuzzy Systems (FUZZ-IEEE).", "links": null}, "BIBREF16": {"ref_id": "b16", "title": "Weka: A machine learning workbench for data mining", "authors": [{"first": "E", "middle": [], "last": "Frank", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Hall", "suffix": ""}, {"first": "G", "middle": [], "last": "Holmes", "suffix": ""}, {"first": "R", "middle": [], "last": "Kirkby", "suffix": ""}, {"first": "B", "middle": [], "last": "Pfahringer", "suffix": ""}, {"first": "I", "middle": ["H"], "last": "Witten", "suffix": ""}], "dblp_id": null, "year": 2005, "venue": "Data mining and knowledge discovery handbook: A complete guide for practitioners and researchers", "volume": "", "issue": "", "pages": "1305--1314", "other_ids": {}, "num": null, "urls": [], "raw_text": "Frank, E., Hall, M. A., Holmes, G., Kirkby, R., Pfahringer, B., & Witten, I. H. (2005). Weka: A machine learning workbench for data mining. In O. Maimon & L. Rokach (Eds.), Data mining and knowledge discovery handbook: A complete guide for practitioners and researchers (pp. 1305-1314). Springer.", "links": null}, "BIBREF17": {"ref_id": "b17", "title": "A comprehensive survey on machine learning approaches for malware detection in iot-based enterprise information system", "authors": [{"first": "A", "middle": [], "last": "Gaurav", "suffix": ""}, {"first": "B", "middle": ["B"], "last": "Gupta", "suffix": ""}, {"first": "P", "middle": ["K"], "last": "Panigrahi", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "Enterprise Information Systems", "volume": "", "issue": "", "pages": "1--25", "other_ids": {}, "num": null, "urls": [], "raw_text": "Gaurav, A., Gupta, B. B., & Panigrahi, P. K. (2022). A comprehensive survey on machine learning approaches for malware detection in iot-based enterprise information system. Enterprise Information Systems, 1-25.", "links": null}, "BIBREF18": {"ref_id": "b18", "title": "Correlation-based feature selection for machine learning", "authors": [{"first": "M", "middle": ["A"], "last": "Hall", "suffix": ""}], "dblp_id": null, "year": 1999, "venue": "", "volume": "", "issue": "", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Hall, M. A. (1999). Correlation-based feature selection for machine learning (Doctoral dissertation). The University of Waikato.", "links": null}, "BIBREF19": {"ref_id": "b19", "title": "An explainable deep learning framework for intrusion detection systems in internet of things networks", "authors": [{"first": "Z", "middle": ["A E"], "last": "Houda", "suffix": ""}, {"first": "B", "middle": [], "last": "Brik", "suffix": ""}, {"first": "L", "middle": [], "last": "Khoukhi", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "IEEE Open Journal of the Communications Society", "volume": "3", "issue": "", "pages": "1164--1176", "other_ids": {}, "num": null, "urls": [], "raw_text": "Houda, Z. A. E., Brik, B., & Khoukhi, L. (2022). \"why should i trust your ids?\": An explainable deep learning framework for intrusion detection systems in internet of things networks. IEEE Open Journal of the Communications Society, 3, 1164-1176.", "links": null}, "BIBREF20": {"ref_id": "b20", "title": "Network intrusion detection combined hybrid sampling with deep hierarchical network", "authors": [{"first": "K", "middle": [], "last": "Jiang", "suffix": ""}, {"first": "W", "middle": [], "last": "Wang", "suffix": ""}, {"first": "A", "middle": [], "last": "Wang", "suffix": ""}, {"first": "H", "middle": [], "last": "Wu", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "IEEE Access", "volume": "8", "issue": "", "pages": "32464--32476", "other_ids": {}, "num": null, "urls": [], "raw_text": "Jiang, K., Wang, W., Wang, A., & Wu, H. (2020). Network intrusion detection combined hybrid sampling with deep hierarchical network. IEEE Access, 8, 32464-32476.", "links": null}, "BIBREF21": {"ref_id": "b21", "title": "In-depth feature selection for the statistical machine learning-based botnet detection in iot networks", "authors": [{"first": "R", "middle": [], "last": "Kalakoti", "suffix": ""}, {"first": "S", "middle": [], "last": "Nõmm", "suffix": ""}, {"first": "H", "middle": [], "last": "Bahsi", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "IEEE Access", "volume": "10", "issue": "", "pages": "94518--94535", "other_ids": {}, "num": null, "urls": [], "raw_text": "Kalakoti, R., Nõmm, S., & Bahsi, H. (2022). In-depth feature selection for the statistical machine learning-based botnet detection in iot networks. IEEE Access, 10, 94518-94535.", "links": null}, "BIBREF22": {"ref_id": "b22", "title": "V-sandbox for dynamic analysis iot botnet", "authors": [{"first": "H.-V", "middle": [], "last": "Le", "suffix": ""}, {"first": "Q.-D", "middle": [], "last": "Ngo", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "IEEE Access", "volume": "8", "issue": "", "pages": "145768--145786", "other_ids": {}, "num": null, "urls": [], "raw_text": "Le, H.-V., & Ngo, Q.-D. (2020). V-sandbox for dynamic analysis iot botnet. IEEE Access, 8, 145768-145786.", "links": null}, "BIBREF23": {"ref_id": "b23", "title": "A unified approach to interpreting model predictions", "authors": [{"first": "S", "middle": [], "last": "Lundberg", "suffix": ""}, {"first": "S.-I", "middle": [], "last": "Lee", "suffix": ""}], "dblp_id": "conf/nips/LundbergL17", "year": 2017, "venue": "Advances in neural information processing systems", "volume": "30", "issue": "", "pages": "4765--4774", "other_ids": {}, "num": null, "urls": [], "raw_text": "Lundberg, S., & Lee, S.-I. (2017). A unified approach to interpreting model predictions. In I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, & R. Garnett (Eds.), Advances in neural information processing systems 30 (pp. 4765-4774).", "links": null}, "BIBREF25": {"ref_id": "b25", "title": "N-baiot -network-based detection of iot botnet attacks using deep autoencoders", "authors": [{"first": "Y", "middle": [], "last": "Meidan", "suffix": ""}, {"first": "M", "middle": [], "last": "Bohadana", "suffix": ""}, {"first": "Y", "middle": [], "last": "Mathov", "suffix": ""}, {"first": "Y", "middle": [], "last": "Mirsky", "suffix": ""}, {"first": "A", "middle": [], "last": "Shabtai", "suffix": ""}, {"first": "D", "middle": [], "last": "Breitenbacher", "suffix": ""}, {"first": "Y", "middle": [], "last": "Elovici", "suffix": ""}], "dblp_id": null, "year": 2018, "venue": "IEEE Pervasive Comput", "volume": "17", "issue": "3", "pages": "12--22", "other_ids": {}, "num": null, "urls": [], "raw_text": "Meidan, Y., Bohadana, M., Mathov, Y., Mirsky, Y., Shabtai, A., Breitenbacher, D., & Elovici, Y. (2018). N-baiot -network-based detection of iot botnet attacks using deep autoencoders. IEEE Pervasive Comput., 17(3), 12-22.", "links": null}, "BIBREF26": {"ref_id": "b26", "title": "Explainable artificial intelligence for intrusion detection system", "authors": [{"first": "S", "middle": [], "last": "Patil", "suffix": ""}, {"first": "V", "middle": [], "last": "Varadarajan", "suffix": ""}, {"first": "S", "middle": [], "last": "Mazhar", "suffix": ""}, {"first": "A", "middle": [], "last": "Sahibzada", "suffix": ""}, {"first": "N", "middle": [], "last": "Ahmed", "suffix": ""}, {"first": "O", "middle": [], "last": "Sinha", "suffix": ""}, {"first": "S", "middle": [], "last": "Kumar V C", "suffix": ""}, {"first": "K", "middle": [], "last": "Shaw", "suffix": ""}, {"first": "K", "middle": [], "last": "Kotecha", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "Electronics", "volume": "11", "issue": "", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Patil, S., Varadarajan, V., Mazhar, S., Sahibzada, A., Ahmed, N., Sinha, O., Kumar V C, S., Shaw, K., & Kotecha, K. (2022). Explainable artificial intelligence for intrusion detection system. Electronics, 11, 3079.", "links": null}, "BIBREF27": {"ref_id": "b27", "title": "Xai models for quality of experience prediction in wireless networks", "authors": [{"first": "A", "middle": [], "last": "Renda", "suffix": ""}, {"first": "P", "middle": [], "last": "Ducange", "suffix": ""}, {"first": "G", "middle": [], "last": "Gallo", "suffix": ""}, {"first": "F", "middle": [], "last": "Marcelloni", "suffix": ""}], "dblp_id": "conf/fuzzIEEE/RendaDGM21", "year": 2021, "venue": "IEEE International Conference on Fuzzy Systems (FUZZ-IEEE)", "volume": "", "issue": "", "pages": "1--6", "other_ids": {}, "num": null, "urls": [], "raw_text": "Renda, A., Ducange, P., Gallo, G., & Marcelloni, F. (2021). Xai models for quality of experience prediction in wireless networks. 2021 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE), 1-6.", "links": null}, "BIBREF28": {"ref_id": "b28", "title": "Explaining the predictions of any classifier", "authors": [{"first": "M", "middle": [], "last": "Ribeiro", "suffix": ""}, {"first": "S", "middle": [], "last": "Singh", "suffix": ""}, {"first": "C", "middle": [], "last": "Guestrin", "suffix": ""}], "dblp_id": null, "year": 2016, "venue": "Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Demonstrations", "volume": "", "issue": "", "pages": "97--101", "other_ids": {}, "num": null, "urls": [], "raw_text": "Ribeiro, M., Singh, S., & Guestrin, C. (2016). \"why should I trust you?\": Explaining the predictions of any classifier. Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Demonstrations, 97-101.", "links": null}, "BIBREF29": {"ref_id": "b29", "title": "On distributed fuzzy decision trees for big data", "authors": [{"first": "A", "middle": [], "last": "Segatori", "suffix": ""}, {"first": "F", "middle": [], "last": "Marcelloni", "suffix": ""}, {"first": "W", "middle": [], "last": "Pedrycz", "suffix": ""}], "dblp_id": null, "year": 2017, "venue": "IEEE Trans. Fuzzy Syst", "volume": "26", "issue": "1", "pages": "174--192", "other_ids": {}, "num": null, "urls": [], "raw_text": "Segatori, A., Marcelloni, F., & Pedrycz, W. (2017). On distributed fuzzy decision trees for big data. IEEE Trans. Fuzzy Syst., 26(1), 174-192.", "links": null}, "BIBREF30": {"ref_id": "b30", "title": "Rule generation for signature based detection systems of cyber attacks in iot environments", "authors": [{"first": "Y", "middle": [], "last": "Soe", "suffix": ""}, {"first": "Y", "middle": [], "last": "Feng", "suffix": ""}, {"first": "P", "middle": [], "last": "Santosa", "suffix": ""}, {"first": "R", "middle": [], "last": "Hartanto", "suffix": ""}, {"first": "K", "middle": [], "last": "Sakurai", "suffix": ""}], "dblp_id": null, "year": 2019, "venue": "Bulletin of Networking, Computing, Systems, and Software", "volume": "8", "issue": "2", "pages": "", "other_ids": {}, "num": null, "urls": [], "raw_text": "Soe, Y., Feng, Y., Santosa, P., Hartanto, R., & Sakurai, K. (2019). Rule generation for signature based detection systems of cyber attacks in iot environments. Bulletin of Networking, Computing, Systems, and Software, 8(2).", "links": null}, "BIBREF31": {"ref_id": "b31", "title": "Machine learning for multi-classification of botnets attacks", "authors": [{"first": "T", "middle": ["C"], "last": "Tran", "suffix": ""}, {"first": "T", "middle": ["K"], "last": "Dang", "suffix": ""}], "dblp_id": "conf/icuimc/TranD22", "year": 2022, "venue": "16th International Conference on Ubiquitous Information Management and Communication (IMCOM)", "volume": "", "issue": "", "pages": "1--8", "other_ids": {}, "num": null, "urls": [], "raw_text": "Tran, T. C., & Dang, T. K. (2022). Machine learning for multi-classification of botnets attacks. 2022 16th International Conference on Ubiquitous Information Management and Communication (IMCOM), 1-8.", "links": null}, "BIBREF32": {"ref_id": "b32", "title": "Machine learning based intrusion detection systems for iot applications", "authors": [{"first": "A", "middle": [], "last": "Verma", "suffix": ""}, {"first": "V", "middle": [], "last": "Ranga", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "Wireless Personal Communications", "volume": "111", "issue": "", "pages": "2287--2310", "other_ids": {}, "num": null, "urls": [], "raw_text": "Verma, A., & Ranga, V. (2020). Machine learning based intrusion detection systems for iot applications. Wireless Personal Communications, 111, 2287-2310.", "links": null}, "BIBREF33": {"ref_id": "b33", "title": "An explainable machine learning framework for intrusion detection systems", "authors": [{"first": "M", "middle": [], "last": "Wang", "suffix": ""}, {"first": "K", "middle": [], "last": "Zheng", "suffix": ""}, {"first": "Y", "middle": [], "last": "Yang", "suffix": ""}, {"first": "X", "middle": [], "last": "Wang", "suffix": ""}], "dblp_id": null, "year": 2020, "venue": "IEEE Access", "volume": "8", "issue": "", "pages": "73127--73141", "other_ids": {}, "num": null, "urls": [], "raw_text": "Wang, M., Zheng, K., Yang, Y., & Wang, X. (2020). An explainable machine learning framework for intrusion detection systems. IEEE Access, 8, 73127-73141.", "links": null}, "BIBREF34": {"ref_id": "b34", "title": "A deep learning approach for intrusion detection using recurrent neural networks", "authors": [{"first": "C", "middle": [], "last": "Yin", "suffix": ""}, {"first": "Y", "middle": [], "last": "Zhu", "suffix": ""}, {"first": "J", "middle": [], "last": "Fei", "suffix": ""}, {"first": "X", "middle": [], "last": "He", "suffix": ""}], "dblp_id": null, "year": 2017, "venue": "IEEE Access", "volume": "5", "issue": "", "pages": "21954--21961", "other_ids": {}, "num": null, "urls": [], "raw_text": "Yin, C., Zhu, Y., Fei, J., & He, X. (2017). A deep learning approach for intrusion detection using recurrent neural networks. IEEE Access, 5, 21954-21961.", "links": null}, "BIBREF35": {"ref_id": "b35", "title": "Explainable artificial intelligence applications in cyber security: State-of-the-art in research", "authors": [{"first": "Z", "middle": [], "last": "Zhang", "suffix": ""}, {"first": "H", "middle": ["M N A"], "last": "Hamadi", "suffix": ""}, {"first": "E", "middle": [], "last": "Damiani", "suffix": ""}, {"first": "C", "middle": ["Y"], "last": "Yeun", "suffix": ""}, {"first": "F", "middle": [], "last": "Taher", "suffix": ""}], "dblp_id": null, "year": 2022, "venue": "IEEE Access", "volume": "10", "issue": "", "pages": "93104--93139", "other_ids": {}, "num": null, "urls": [], "raw_text": "Zhang, Z., Hamadi, H. M. N. A., Damiani, E., Yeun, C. Y., & Taher, F. (2022). Explainable artificial intelligence applications in cyber security: State-of-the-art in research. IEEE Access, 10, 93104-93139.", "links": null}}}, "ner": [{"syntactic": ["artificial intelligence", "machine learning", "fuzzy decision trees", "internet of things", "ids", "intrusion detection", "internet", "malware attacks", "cyber threats", "traffic classification"], "semantic": ["artificial intelligence", "machine learning", "fuzzy decision trees", "internet of things", "ids", "intrusion detection", "internet", "decision trees", "malware attacks", "cyber threats", "traffic classification", "malwares"], "union": ["artificial intelligence", "machine learning", "fuzzy decision trees", "internet of things", "ids", "intrusion detection", "internet", "decision trees", "malware attacks", "cyber threats", "traffic classification", "malwares"], "enhanced": ["computer science", "architecture types", "network security", "computer crime", "data mining", "classifiers", "cyber security", "telecommunication traffic", "operating systems"], "Metrics": [], "ProgLang": [], "Dataset": [], "MathTerm": [], "IT Framework": [], "ISO": [], "Technology": ["AI"], "Terms": ["IDS", "XAI"], "TechName": ["AI", "XAI"]}]}