{
    "paper_id": "3544109",
    "header": {
        "generated_with": "S2ORC 1.0.0",
        "date_generated": "2024-03-20T17:52:53.992391Z"
    },
    "title": "Research on fast extraction algorithm of big data information based on machine learning",
    "authors": [
        {
            "first": "Wenchen",
            "middle": [],
            "last": "Wu",
            "suffix": "",
            "affiliation": {},
            "email": ""
        },
        {
            "first": "Xuliang",
            "middle": [],
            "last": "Yang",
            "suffix": "",
            "affiliation": {},
            "email": ""
        }
    ],
    "year": "",
    "venue": null,
    "identifiers": {},
    "abstract": "With the development of the information industry, people are faced with an increasing amount of data. In order to obtain the intrinsic relationship and implicit information from these large-scale data, data mining as an important method has been paid more and more attention by people, and cluster analysis is an important research direction of data mining. In the era of big data, massive multimodal data exists widely. How to mine the huge hidden value of data through complementary learning between modal data is the main problem of big data research at this stage, and it is also the task of big data and traditional data learning. Mixed attribute datasets are the most common type of datasets in the real world, especially in commercial financial databases, but there are very few clustering algorithms suitable for such datasets. The method used in this paper is machine learning, which enables computers to simulate human learning behavior, automatically acquire knowledge and skills through learning, continuously improve performance, and achieve self-improvement.",
    "pdf_parse": {
        "abstract": [
            {
                "text": "With the development of the information industry, people are faced with an increasing amount of data. In order to obtain the intrinsic relationship and implicit information from these large-scale data, data mining as an important method has been paid more and more attention by people, and cluster analysis is an important research direction of data mining. In the era of big data, massive multimodal data exists widely. How to mine the huge hidden value of data through complementary learning between modal data is the main problem of big data research at this stage, and it is also the task of big data and traditional data learning. Mixed attribute datasets are the most common type of datasets in the real world, especially in commercial financial databases, but there are very few clustering algorithms suitable for such datasets. The method used in this paper is machine learning, which enables computers to simulate human learning behavior, automatically acquire knowledge and skills through learning, continuously improve performance, and achieve self-improvement.",
                "cite_spans": [],
                "section": "Abstract",
                "sec_num": null
            }
        ],
        "body_text": [
            {
                "text": "In recent years, with the rapid development of the information industry, human beings are faced with a great increase in the amount of information. As early as the 1980s, according to rough estimates, the amount of global information doubled every month. The scale of owned databases and stored data grows faster [1] . With the rapid development of the Internet of Things, social networks, and ecommerce, data is growing and accumulating at an unprecedented rate [2] . At present, the number of various sensors in data acquisition terminal equipment has increased sharply, and the scale of data generated by multi-dimensional sensors has expanded rapidly, including the amount of accumulated data in finance, transportation, energy, retail, telecommunications, catering and other industries. It is becoming more and more abundant and complex, and the traditional data management system and data processing mode can no longer meet the needs of new business. \"Large\" data scale is still the first characteristic of big data [3] . Massive data scale brings dual challenges to computing: on the one hand, large-scale data sets require computing devices with larger memory capacity; on the other hand, the rapid growth of data scale will directly lead to a significant drop in computational efficiency [4] . The clustering method can reveal the internal relationship between data without prior knowledge, and group the data with the same attributes into one category, which can mine valuable information in the campus network big data, which is convenient for information storage and further analysis. Traditional clustering methods have been successfully applied to the clustering of small data sets, but under the network big data, the time and space complexity of traditional methods are not enough. And for research needs, these data will be kept for several years. There is an urgent need to extract or convert useful information and knowledge from large-scale datasets. In order to discover useful information for people and the implicit relationship in the data [5] .",
                "cite_spans": [
                    {
                        "start": 313,
                        "end": 316,
                        "text": "[1]",
                        "ref_id": "BIBREF0"
                    },
                    {
                        "start": 463,
                        "end": 466,
                        "text": "[2]",
                        "ref_id": "BIBREF1"
                    },
                    {
                        "start": 1022,
                        "end": 1025,
                        "text": "[3]",
                        "ref_id": "BIBREF2"
                    },
                    {
                        "start": 1297,
                        "end": 1300,
                        "text": "[4]",
                        "ref_id": "BIBREF3"
                    },
                    {
                        "start": 2064,
                        "end": 2067,
                        "text": "[5]",
                        "ref_id": "BIBREF4"
                    }
                ],
                "section": "INTRODUCTION",
                "sec_num": "1"
            },
            {
                "text": "With the rapid development of the information industry, people urgently need to convert large-scale data into useful information and knowledge, and obtain the intrinsic relationship and implicit information between the data. Data mining is proposed to solve this problem. It combines statistics, database, artificial intelligence, machine learning and other technologies, and has gradually become a research hotspot [6] . While the scale of data has exploded, the added value of data does not seem to have kept pace. How to extract valuable information from data has become the most pressing problem. In this environment, data mining has begun to receive extensive attention from scholars, and data clustering is one of the hot topics in the field of data mining, which has a wide range of applications in the real world. The data mining function is shown in Figure The process of grouping a collection of physical or abstract objects into multiple classes of similar objects is called clustering [7] . The clustering algorithm is an unsupervised machine learning algorithm, and unlike supervised learning algorithms, we do not have any prior knowledge of the distribution of the dataset. In recent years, the problem of imbalanced data classification has become a research hotspot in the fields of data mining and machine learning. Imbalanced data usually means that the number of samples of some classes in a data set is far more than other classes [8] . The key research object of the machine learning industry is the classification problem. Some classification methods are becoming more and more mature. Using these classification methods to classify balanced data can definitely have good results. However, there are still many unbalanced data and existence in many industries. Traditional clustering algorithms are mainly designed for data with a single attribute. A large number of studies have shown that most of the current data are not single attribute, but mixed attribute data. This makes traditional clustering algorithms unable to handle such mixed-attribute datasets [9] . The stage diagram of the clustering technique is shown in Figure 2 Clustering analysis is an important research field of data mining. It is an unsupervised learning method. It divides data into several classes according to the defined similarity through certain rules. These classes are composed of many data points with similar properties. Data in the same class are similar to each other and different from data in other classes. Many real-world needs require clustering data in order to find categories of interest. For example, in customer relationship management, banks or securities companies conduct risk assessment and customer value analysis on customers based on their personal attributes, assets, and transaction behavior. Most real data are massive data sets, and data attributes include both numerical attributes and class attributes.",
                "cite_spans": [
                    {
                        "start": 416,
                        "end": 419,
                        "text": "[6]",
                        "ref_id": "BIBREF5"
                    },
                    {
                        "start": 997,
                        "end": 1000,
                        "text": "[7]",
                        "ref_id": "BIBREF6"
                    },
                    {
                        "start": 1451,
                        "end": 1454,
                        "text": "[8]",
                        "ref_id": "BIBREF7"
                    },
                    {
                        "start": 2082,
                        "end": 2085,
                        "text": "[9]",
                        "ref_id": "BIBREF8"
                    }
                ],
                "section": "BIG DATA INFORMATION FAST EXTRACTION ALGORITHM 2.1 Cluster fusion",
                "sec_num": "2"
            },
            {
                "text": "1",
                "cite_spans": [],
                "section": "BIG DATA INFORMATION FAST EXTRACTION ALGORITHM 2.1 Cluster fusion",
                "sec_num": "2"
            },
            {
                "text": "Data clustering is an important branch of data mining. Most of the existing data clustering algorithms are limited to processing data with only continuous attributes, and a small number of algorithms are limited to processing data with only nominal attributes. When dealing with a class of attributes, data information will inevitably be lost under the condition of mixed attributes, which will affect the quality of data mining. The so-called clustering is the process of grouping objects into similar objects to form multiple classes, so that the objects in the same class have high similarity, but the objects in the same class have low similarity [10] . With the development of technology, many fields, such as data transmission in the Internet, call data in communication networks, website access logs, etc., are generating a large amount of data all the time. At present, a variety of clustering algorithms have been divided. Clustering analysis is a very active research branch of data mining, which has a wide range of applications. According to the type of data, the characteristics of practical problems and the purpose of clustering, many clustering algorithms have been proposed in the literature. These data are massive, unbounded, and variablespeed streaming data. Therefore, it is of great significance to study the clustering problem in the streaming data environment. The Kprototypes algorithm is an effective algorithm proposed by Huang that can cluster data with a mixture of categorical and numerical attributes. Its basic idea is similar to the K-means algorithm, but in the K-pmtov/pes algorithm, a similarity measure that calculates both the numerical and categorical attributes is defined as the objective function of the clustering. The prototype is used to optimize the objective function and obtain the optimal clustering effect. Database knowledge discovery technology and data mining technology are ",
                "cite_spans": [
                    {
                        "start": 651,
                        "end": 655,
                        "text": "[10]",
                        "ref_id": "BIBREF9"
                    }
                ],
                "section": "CEMC",
                "sec_num": "2.2"
            },
            {
                "text": "With the rapid development of the Internet and sensor technology, the data obtained by people has gradually evolved from a singleview description in the past to a ubiquitous multi-view description. Therefore, multi-view learning has become a research hotspot in the fields of artificial intelligence and machine learning. Multiview clustering analysis, as a main research direction for multiview learning tasks, has developed rapidly in the past few decades and has made great progress. The clustering problem is a very popular problem in recent years. The clustering problem is to gather messy data into different clusters, so that similar data belong to the same clustering category. Multi-view clustering is an important learning modality because of its ability to integrate consistent and complementary information between different views. Multi-view clustering is a method of clustering multi-view data. In traditional clustering algorithms, it is assumed that the data has only one view, but in fact, multi-view data is widespread. In the era of big data, the ability of human beings to collect, store, transmit, and manage data is increasing day by day, and various industries have accumulated a large number of data resources, which often show multi-source and heterogeneity. How to effectively cluster these multi-source data (also known as multi-view clustering) has become one of the focuses of current machine learning research. Cluster analysis is the basic tool of data mining, and its main purpose is to divide the data set into several subsets according to the similarity between samples. For the clustering problem of high-dimensional multiview datasets, methods based on subspace learning have received extensive attention due to their good clustering performance. The schematic diagram of cluster fusion is shown in Figure 3 At present, graph-based methods are increasingly used in clustering. Graph-based clustering methods measure edges in the original data graph with a similarity matrix, and obtain the clustering result from the similarity between data points. . Multi-view clustering based on graph learning has received extensive attention due to its simplicity and efficiency. However, affected by the heterogeneous information between different views and the possible noise in the actual data, existing multi-view clustering methods based on graph learning directly learn consistent graphs from multiple views or multiple graphs, and it is difficult to accurately characterize the structure of all views, thereby reducing the stability and correctness of clustering. For graph-based multi-view clustering, the purpose usually focuses on how to learn a high-quality relational matrix (relationship graph), and then the spectral algorithm or graph-cut algorithm acts on the graph to obtain the final clustering result. In multi-view clustering, the clustered data is composed of multiple views, which are characterized by consistency and complementarity, and all views share the same label information.",
                "cite_spans": [],
                "section": "RESEARCH ON FAST EXTRACTION ALGORITHM OF BIG DATA INFORMATION BASED ON MACHINE LEARNING 3.1 Multi-view clustering",
                "sec_num": "3"
            },
            {
                "text": "Cluster analysis is an important method to find the natural aggregation structure of data. How to correctly determine the number of clusters is the key to determine the quality of clustering, and it is also a difficult problem of data clustering. Theoretically, the greater the number of rules in the model, the stronger the approximation ability of the model; but in practice, the initial rule base obtained from the data through the fuzzy system has similar or redundant fuzzy sets, which leads to the system's approximation ability. Accuracy drops. In a large number of practical optimization design problems, the objective function usually has multi-modal characteristics. Solving such problems often requires searching for multiple global optimal solutions and meaningful local optimal solutions, providing decision makers with a variety of choices, so as to obtain better practical results. Text classification is an important part of text mining, which is of great significance in improving the speed and accuracy of information retrieval. Because the vector space model (VSM) has a better data structure, it is a commonly used text representation method.",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "Random sampling is performed on the data within the field of each initial cluster center, and the method for calculating the data volume of a single sample set is given:",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "In the formula, f (0 ≤ f ≤ 1) is the extraction ratio, n is the data volume, C i is the data volume of the i-th class, and Equation 1) means that no less than f × n i data points are extracted from the class C i according to the probability of 1 -δ (0 ≤ δ ≤ 1), which is a single sample size s.",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "According to the size of the sampling sample set calculated by Equation 1), in this paper, a large data set X of size n is randomly sampled at m times of equal scale, and the sampling conditions are:",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "EQUATION",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "In the formula, i = 1, 2, . . . , m, j = 1, 2, . . . , m, i j, m ∈ Z , each sampling sample has no intersection.",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "High-dimensional data clustering is an important subject in cluster analysis, and it has been widely used in market analysis, information security, finance, medicine, engineering and so on. The methods for selecting the number of clusters can be divided into two categories: local determination method and global determination method. Among them, the local determination method is suitable for hierarchical clustering algorithm. Since it is necessary to judge whether different classes are merged or split in the clustering process, it makes the process of determining the number of clusters becomes more tedious. In the modeling process of fuzzy systems, it is very important to improve the accuracy by simplifying or eliminating the initial rule base. The search algorithm based on derivative information cannot avoid falling into local extrema, and although the traditional genetic algorithm has good global search ability, it generally cannot find and maintain multiple local extremum points, and cannot meet the needs of multimodal function optimization problems. Because almost every word in the text set has to be given a weight, the text vector has a very high dimension, usually several thousand or ten thousand dimensions. Existing techniques have successfully solved the clustering problem of lower dimensional data. However, for high-dimensional data, the distribution characteristics of the data are very different compared to the low-dimensional case, making many algorithms ineffective. The global determination method is to manually determine the number of clusters according to the clustering index and the clustering results of different numbers of clusters. It is usually suitable for dividing the clustering method, and its workload will increase rapidly with the increase of the amount of data. From the special case of TSK fuzzy model starting with the single-valued fuzzy model, the initial fuzzy model is established by using the PNC2 algorithm; then, the parameters involved in the rule set of the initial fuzzy model are optimized by combining with the genetic algorithm, so as to obtain an optimal single-valued fuzzy model.",
                "cite_spans": [],
                "section": "Genetic Algorithms",
                "sec_num": "3.2"
            },
            {
                "text": "In the era of big data, the analysis and mining of multi-modal data is a research field that has attracted much attention. Effectively learning the characteristics of massive, low-quality, heterogeneous, high-dimensional and rapidly changing multi-modal data is also faced with a series of problems and challenges. Starting from the modal incompleteness, real-time processing, modal imbalance and high-dimensionality of attributes of multimodal data, this paper conducts in-depth research and discussion on the corresponding multimodal data fusion algorithm. Data mining is an emerging discipline in recent years. After it came into being, it provides convenience for people to analyze large-scale data sets and find useful information from the data. As an important method of data mining, cluster analysis has also been paid much attention by people, and it has been successfully applied in business, biology, gene classification and text classification. There are a lot of mixed attribute data in the real world, especially in business data. By reviewing the existing algorithms, it is found that there are very few algorithms suitable for mixed attribute clustering, and their performance needs to be improved.",
                "cite_spans": [],
                "section": "CONCLUSIONS",
                "sec_num": "4"
            }
        ],
        "bib_entries": {
            "BIBREF0": {
                "ref_id": "b0",
                "title": "A survey on deep learning for big data",
                "authors": [
                    {
                        "first": "Q",
                        "middle": [],
                        "last": "Zhang",
                        "suffix": ""
                    },
                    {
                        "first": "L T",
                        "middle": [],
                        "last": "Yang",
                        "suffix": ""
                    },
                    {
                        "first": "Z",
                        "middle": [],
                        "last": "Chen",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2018,
                "venue": "Information Fusion",
                "volume": "42",
                "issue": "",
                "pages": "146--157",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Zhang Q, Yang L T, Chen Z, et al. A survey on deep learning for big data. Infor- mation Fusion, vol. 42, pp. 146-157, 2018.",
                "links": null
            },
            "BIBREF1": {
                "ref_id": "b1",
                "title": "A Survey on Emerging Computing Paradigms for Big Data",
                "authors": [
                    {
                        "first": "",
                        "middle": [],
                        "last": "Yaoxue",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Zhang",
                        "suffix": ""
                    },
                    {
                        "first": "",
                        "middle": [],
                        "last": "Ju",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2017,
                "venue": "Chinese Journal of Electronics",
                "volume": "26",
                "issue": "1",
                "pages": "1--12",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Yaoxue, Zhang, Ju, et al. A Survey on Emerging Computing Paradigms for Big Data. Chinese Journal of Electronics, vol. 26, no. 1, pp. 1-12, 2017.",
                "links": null
            },
            "BIBREF2": {
                "ref_id": "b2",
                "title": "Machine Learning on Big Data: Opportunities and Challenges",
                "authors": [
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Zhou",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Pan",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wang",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2017,
                "venue": "Neurocomputing",
                "volume": "237",
                "issue": "10",
                "pages": "350--361",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Zhou L, Pan S, Wang J, et al. Machine Learning on Big Data: Opportunities and Challenges. Neurocomputing, vol. 237, no. 10, pp. 350-361, 2017.",
                "links": null
            },
            "BIBREF3": {
                "ref_id": "b3",
                "title": "Software-Defined Networks with Mobile Edge Computing and Caching for Smart Cities: A Big Data Deep Reinforcement Learning Approach",
                "authors": [
                    {
                        "first": "Y",
                        "middle": [],
                        "last": "He",
                        "suffix": ""
                    },
                    {
                        "first": "F R",
                        "middle": [],
                        "last": "Yu",
                        "suffix": ""
                    },
                    {
                        "first": "N",
                        "middle": [],
                        "last": "Zhao",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2017,
                "venue": "IEEE Communications Magazine",
                "volume": "55",
                "issue": "12",
                "pages": "31--37",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "He Y, Yu F R, Zhao N, et al. Software-Defined Networks with Mobile Edge Com- puting and Caching for Smart Cities: A Big Data Deep Reinforcement Learning Approach. IEEE Communications Magazine, vol. 55, no. 12, pp. 31-37, 2017.",
                "links": null
            },
            "BIBREF4": {
                "ref_id": "b4",
                "title": "Persisting big-data: The NoSQL landscape",
                "authors": [
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Corbellini",
                        "suffix": ""
                    },
                    {
                        "first": "C",
                        "middle": [],
                        "last": "Mateos",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Zunino",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2017,
                "venue": "Information Systems",
                "volume": "63",
                "issue": "1",
                "pages": "1--23",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Corbellini A, Mateos C, Zunino A, et al. Persisting big-data: The NoSQL landscape. Information Systems, vol. 63, no. 1, pp. 1-23, 2017.",
                "links": null
            },
            "BIBREF5": {
                "ref_id": "b5",
                "title": "Machine Learning on Big Data: Opportunities and Challenges",
                "authors": [
                    {
                        "first": "L",
                        "middle": [],
                        "last": "Zhou",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Pan",
                        "suffix": ""
                    },
                    {
                        "first": "J",
                        "middle": [],
                        "last": "Wang",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2017,
                "venue": "Neurocomputing",
                "volume": "237",
                "issue": "10",
                "pages": "350--361",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Zhou L, Pan S, Wang J, et al. Machine Learning on Big Data: Opportunities and Challenges. Neurocomputing, vol. 237, no. 10, pp. 350-361, 2017.",
                "links": null
            },
            "BIBREF6": {
                "ref_id": "b6",
                "title": "When Machine Learning Meets Big Data: A Wireless Communication Perspective",
                "authors": [
                    {
                        "first": "",
                        "middle": [],
                        "last": "Liu",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Bi",
                        "suffix": ""
                    },
                    {
                        "first": "Z",
                        "middle": [],
                        "last": "Shi",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2020,
                "venue": "IEEE Vehicular Technology Magazine",
                "volume": "15",
                "issue": "1",
                "pages": "63--72",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Y Liu, Bi S, Shi Z, et al. When Machine Learning Meets Big Data: A Wireless Communication Perspective. IEEE Vehicular Technology Magazine, vol. 15, no. 1, pp. 63-72, 2020.",
                "links": null
            },
            "BIBREF7": {
                "ref_id": "b7",
                "title": "Enabling Cognitive Smart Cities Using Big Data and Machine Learning: Approaches and Challenges",
                "authors": [
                    {
                        "first": "M",
                        "middle": [],
                        "last": "Mohammadi",
                        "suffix": ""
                    },
                    {
                        "first": "A",
                        "middle": [],
                        "last": "Al-Fuqaha",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2018,
                "venue": "IEEE Communications Magazine",
                "volume": "56",
                "issue": "2",
                "pages": "94--101",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Mohammadi M, Al-Fuqaha A. Enabling Cognitive Smart Cities Using Big Data and Machine Learning: Approaches and Challenges. IEEE Communications Magazine, vol. 56, no. 2, pp. 94-101, 2018.",
                "links": null
            },
            "BIBREF8": {
                "ref_id": "b8",
                "title": "Data Analytics and Machine Learning for Smart Process Manufacturing: Recent Advances and Perspectives in the Big Data Era",
                "authors": [
                    {
                        "first": "F",
                        "middle": [
                            "Y"
                        ],
                        "last": "Sa Chao",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2019,
                "venue": "Engineering",
                "volume": "5",
                "issue": "6",
                "pages": "1010--1016",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "SA Chao, FY B. Data Analytics and Machine Learning for Smart Process Manu- facturing: Recent Advances and Perspectives in the Big Data Era. Engineering, vol. 5,no. 6, pp. 1010-1016, 2019.",
                "links": null
            },
            "BIBREF9": {
                "ref_id": "b9",
                "title": "Anatomy of machine learning algorithm implementations in MPI, Spark, and Flink",
                "authors": [
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Kamburugamuve",
                        "suffix": ""
                    },
                    {
                        "first": "P",
                        "middle": [],
                        "last": "Wickramasinghe",
                        "suffix": ""
                    },
                    {
                        "first": "S",
                        "middle": [],
                        "last": "Ekanayake",
                        "suffix": ""
                    }
                ],
                "dblp_id": null,
                "year": 2018,
                "venue": "Experimental Mechanics",
                "volume": "32",
                "issue": "1",
                "pages": "61--73",
                "other_ids": {},
                "num": null,
                "urls": [],
                "raw_text": "Kamburugamuve S, Wickramasinghe P, Ekanayake S, et al. Anatomy of machine learning algorithm implementations in MPI, Spark, and Flink. Experimental Mechanics, vol. 32, no. 1, pp. 61-73, 2018.",
                "links": null
            }
        }
    }
}